Revit 2024 API
AreaBasedLoadData.GetElectricalLoadAreas Method
 Gets electrical load areas which the area based load includes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ISet<ElementId> GetElectricalLoadAreas()
Visual Basic
Public Function GetElectricalLoadAreas As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetElectricalLoadAreas()
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace